app/Controllers/Home.php

INSERT INTO `usuarios` (`nombre`, `apellidos`, `sexo`, `email`, `telefono`, `tipo_usuario`, `password`) VALUES ('Aldair', 'Martinez Luna', 'Masculino', 'martinezl.aldair2@gmail.com', '5564756442', 'Administrativo', '$2y$10$IQeJQfV0EXlpZKXzvbhZyueLGtJeF8XbYKdVapiwjGsyRVjcJsN1W')
---
    public function agregarUsuario()
    {
        $data = [];

        if ($this->request->getMethod() === 'post') {
            $rules = [
                'nombre' => 'required|min_length[3]|max_length[50]',
                'apellidos' => 'required|min_length[3]|max_length[100]',
                'sexo' => 'required|in_list[Masculino,Femenino,Otro]',
                'email' => 'required|valid_email|is_unique[usuarios.email]',
                'telefono' => 'required|min_length[10]|max_length[15]',
                'codigo_postal' => 'required|exact_length[5]|numeric',
                'colonia' => 'required',
                'municipio' => 'required',
                'estado' => 'required',
                'tipo_usuario' => 'required|in_list[Administrativo,Administrativo-Operativo,Operativo]'
            ];

            if ($this->validate($rules)) {
                $this->db->transStart();

                try {
                    $postData = $this->request->getPost();

                    $usuarioId = $this->usuarioModel->insert($postData);

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'
---
    public function verUsuario($id)
    {
        $usuario = $this->usuarioModel->find($id);

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'
---
    public function editarUsuario($id)
    {
        $usuario = $this->usuarioModel->find($id);

UPDATE `usuarios` SET `nombre` = 'Aldair', `apellidos` = 'Martinez Luna', `sexo` = 'Masculino', `email` = 'martinezlunaaljo@gmail.com', `telefono` = '5564756442', `tipo_usuario` = 'Administrativo'
WHERE `usuarios`.`id` IN ('1')
---
                    $postData = $this->request->getPost();

                    // Actualizar usuario
                    $this->usuarioModel->update($id, $postData);

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'
UPDATE `usuarios` SET `estatus` = 'Inactivo'
WHERE `usuarios`.`id` IN ('1')
---
    public function cambiarEstatus($id)
    {

        $usuario = $this->usuarioModel->find($id);

        if (!$usuario) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Usuario no encontrado'
            ]);
        }

        $nuevoEstatus = $usuario['estatus'] === 'Activo' ? 'Inactivo' : 'Activo';

        if ($this->usuarioModel->update($id, ['estatus' => $nuevoEstatus])) {

SELECT *
FROM `usuarios`
---
    public function reportes()
    {
        $usuarios = $this->usuarioModel->findAll();